---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ProfileParamAlongPath
source: html/56502a6c-543e-5384-c4e9-385ff78a0513.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ProfileParamAlongPath Property

"Parameter along path"

## Syntax (C#)
```csharp
public static ForgeTypeId ProfileParamAlongPath { get; }
```